[
  {
    "title": "預購《神話時代：重述》 – 永恆天柱 ",
    "link": "https://www.ageofempires.com/news/%e9%a0%90%e8%b3%bc%e3%80%8a%e7%a5%9e%e8%a9%b1%e6%99%82%e4%bb%a3%ef%bc%9a%e9%87%8d%e8%bf%b0%e3%80%8b-%e6%b0%b8%e6%81%86%e5%a4%a9%e6%9f%b1/",
    "description": "在《永恆天柱》這款《神話時代：重述》首部資料片中展開傳奇旅程！運用神力、領導神話生物，建造雄偉城市，同時體驗豐富的中國文化和神話。從引人入勝的神祇到錯綜複雜的景觀，《永恆天柱》將擴展你的戰略可能性，並讓你沉浸在充滿活力的神話世界中。《永恆天柱》現已開放預購，並於 3 月 4 日推出！ 關鍵特色一覽  此 DLC 包含  有了《永恆天柱》，你將能駕馭中國古代神話的力量，探索眾神、怪物和傳奇在這款神話策略遊戲史詩般新篇章中碰撞的世界。 &#160; 眾神的新萬神殿   踏入中原，與 12 位新神祇一起冒險，每位都提供獨特力量，重新定義戰略和遊戲玩法。召喚中國民間傳說中的神獸單位，部署神力來重塑戰鬥，並見證眾神之力。每位神祇都能為遊戲玩法帶來無與倫比的深度，提供全新戰略和神聖干預，例如：    駕馭神話生物的力量   指揮傳奇單位，例如會噴火的麒麟、飛翔的青龍，以及會吞噬敵人將其作為火焰爆炸噴出的兇猛饕餮。這些生物直接取材自中國民間傳說，能將每次遭遇都變成動態且不可測的戰鬥。    史詩般神話與傳奇戰役 深入這個英雄主義、冒險和故事講述成為焦點的九關戰役。在充滿神明、傳奇生物和令人難忘的反派的敘事旅程中。這場戰役將帶你深入中國神話的核心，每場戰鬥和每個選擇都會塑造你的傳奇。   建造中原  設計靈感來自中國古代建築的廣闊城市。招募獨特單位，釋放強大加成，並以戰略深度和文化真實性的結合來碾壓敵人。精心設計的建築為你的帝國增添了美學和戰術優勢。   新地圖和生物群落   在七張捕捉中國風景之美的迷人新地圖上戰鬥。探索竹林，沿著絲綢之路旅行，並征服傳奇長城。每個生物群落，從高聳山脈到茂盛河谷，在在挑戰玩家適應獨特環境的能力。   與眾不同的資料片   永恆天柱不僅是資料片，更是通往以真實性和熱情呈現文化的門戶。無論你是經驗豐富的玩家還是《Age of Mythology》系列遊戲的新手，此資料片都能以其獨特戰略、神話和故事敘述吸引你。  開發人員的話  我們很興奮地揭曉《永恆天柱》的細節，它深深紮根於古老而深刻的神話。我們很榮幸有這個機會以中國人開發者的身分描述中國文明，並有機會向世界介紹我們的中國神話、文化、故事和上古文明。這是很令人自豪的事，因為中國神話有如此多的內容，讓我們能探索並作為獨特文化傳遞給世界。我們的團隊沉浸在中國歷史的輝煌時代，努力將其強大軍事單位和獨特的藝術表現形式栩栩如生地呈現出來。我們將年輕時點燃我們想像力的熱情和對歷史的好奇心，編織進了《永恆天柱》。 [Text Wrapping Break][Text Wrapping Break]對我們許多人來說，我們從小就喜歡神話和怪物的故事情節，還花了很多時間玩《Age of Empires》。將這些東西結合在一起非常神奇，我們很幸運能從事如此貼近我們內心的工作。我們希望為大家提供遨遊這個古代萬神殿歷史的迷人旅程。  -Virtuous 團隊  我們 Forgotten Empires 擁有超過十年的《 Age of Empires》系列遊戲開發經驗，並且一如既往地，我們在開發《永恆天柱》時，始終密切關注我們的標誌性特徵；創新、真實，以及最重要的樂趣。將中國如此豐富的文化加入遊戲中，就需要同樣豐富的描繪，我們很高興能運用我們身為長期熱情遊戲開發人員的經驗及敘事、視覺和遊戲玩法專業知識。《永恆天柱》是對中國歷史和神話的致敬；對整個《 Age of Empires》系列遊戲的致敬；最重要的是，對我們全球玩家群的致敬。我們希望《永恆天柱》能帶給你們所有人與我們一樣的快樂，並且一如既往地感謝你們對這個令人超棒系列的持續熱情！  -Forgotten Empires 團隊 立即預購《神話時代：重述》– 永恆天柱！  等待已經結束 – 中國萬神殿現已開放預購！永恆天柱，這款備受期待的《神話時代：重述》首款資料片，邀請你駕馭中國古代神話的力量。探索眾神、怪物和傳奇在這款神話策略遊戲史詩般新篇章中碰撞的世界。  永恆天柱現已在 &#8230; <a href=\"https://www.ageofempires.com/news/%e9%a0%90%e8%b3%bc%e3%80%8a%e7%a5%9e%e8%a9%b1%e6%99%82%e4%bb%a3%ef%bc%9a%e9%87%8d%e8%bf%b0%e3%80%8b-%e6%b0%b8%e6%81%86%e5%a4%a9%e6%9f%b1/\">Continued</a>",
    "pubDate": "Tue, 18 Feb 2025 18:20:22 +0000",
    "image": "https://cdn.ageofempires.com/aoe/wp-content/uploads/2025/01/immortal_pillars_1920x1080_key_art-1080x608.webp"
  },
  {
    "title": "The Four Perils of the Immortal Pillars",
    "link": "https://www.ageofempires.com/news/the-four-perils-of-the-immortal-pillars/",
    "description": "In Age of Mythology: Retold – Immortal Pillars, our goal was to create compelling gameplay that is authentic to Chinese mythology. To do this, we sought Chinese designers, artists, and experts in Chinese mythology. Together with the teams at Virtuos Shanghai, Forgotten Empires, and Tantalus, we strived to create a well-researched bestiary of unique and &#8230; <a href=\"https://www.ageofempires.com/news/the-four-perils-of-the-immortal-pillars/\">Continued</a>",
    "pubDate": "Fri, 14 Feb 2025 18:00:00 +0000",
    "image": "https://cdn.ageofempires.com/aoe/wp-content/uploads/2025/02/The_Four_Perils_Immortal_Pillars_1920x1080-1080x608.webp"
  },
  {
    "title": "Age of Empires IV – Patch 12.2.3327",
    "link": "https://www.ageofempires.com/news/age-of-empires-iv-patch-12-2-3327/",
    "description": "Happy belated New Year, Age IV community! We shared some exciting news last week. And now we’re back with more of what you’re looking for: balance updates, bug fixes, plus a brand new seasonal event and game mode. ",
    "pubDate": "Thu, 13 Feb 2025 17:00:00 +0000",
    "image": "https://cdn.ageofempires.com/aoe/wp-content/uploads/2025/02/S9_Event_3_Patch_Banner_1920x1080-1080x608.webp"
  },
  {
    "title": "预购《神话时代：重述版 —— 不朽之柱",
    "link": "https://www.ageofempires.com/news/%e9%a2%84%e8%b4%ad%e3%80%8a%e7%a5%9e%e8%af%9d%e6%97%b6%e4%bb%a3%ef%bc%9a%e9%87%8d%e8%bf%b0%e7%89%88-%e4%b8%8d%e6%9c%bd%e4%b9%8b%e6%9f%b1/",
    "description": "欢迎各位玩家在《神话时代：重述版》的首个扩展包《不朽之柱》中开启一段传奇之旅！一起来操控神力，率领传奇灵兽，建造雄伟的城市，体验丰富的中国神话与文化。《不朽之柱》中的神话世界活力饱满，神祇诱人，景观精致，战略性更深。《不朽之柱》现已开启预购，将于3月4日正式发布！ 关键特色&#160; 此DLC包含内容 《不朽之柱》包含了中国古代神话的新篇章，一个神祇、怪物和传说共生的世界，一场史诗般的神话战略。 全新神祇殿堂 踏入中土，迎接12位新神祇，每位神祇都带来独特的力量，重新定义战略和游戏玩法。从中国民间传说中召唤神话兵种，派遣神力重塑战局，见证神祇的强大力量。每位神祇都给游戏玩法带来前所未有的深度，提供新的战略和神圣干预，如： 驾驭神话灵兽的强大力量 指挥传奇兵种，如喷火的麒麟、飞翔的青龙以及吞噬敌人并将其作为火焰爆炸释放的凶兽饕餮。这些来自中国民间传说的神话灵兽，使每一场战斗都变得充满动态和不可预测性 史诗般的神话与传说战役&#160; 投入一场充满了豪勇、冒险与叙事的九关战役，一段由神祇、传奇灵兽与难忘反派驱动的中国神话旅程。深入以中国神话为核心的战役，用一场场战斗和一次次选择来塑造属于您的传奇。 构建中土 设计受古代中国建筑启发的宏大城市。招募独特的兵种，释放强力的增益效果，并以战略深度与文化真实性的结合征服你的敌人。精心设计的建筑会给你的帝国增添美学与战术上的优势。 全新地图和生物群落&#160; 在七张令人惊叹的新地图上展开战斗，领略中国景观的美丽。探索竹林，沿丝绸之路旅行，征服传奇的长城。从巍峨的山脉到郁郁葱葱的河谷，每个独特的环境都充满了挑战。 与众不同的扩展包 《不朽之柱》不是一个寻常的扩展包，它将把您带入一个真实感饱满，用激情创制的的文化。无论你是经验丰富的玩家，还是首次接触《神话时代》系列的新手，这个扩展包凭借其独特的战略、神话与叙事融合，一定会让你为之着迷。 来自开发者的消息 我们怀着激动的心情揭开深深植根于古老而深刻的神话中的《不朽之柱》面纱。作为中国开发者，我们感到非常荣幸能有机会描绘中国文明，并将我们的中国神话、文化、故事和古代文明介绍给全世界。这令我们非常感到自豪，因为中国神话蕴藏着丰富的内容，值得我们去探索并将其作为独特文化传递给世界。我们的团队沉浸于中国历史的辉煌时代，努力将那些强大的军事单位及其独特的艺术栩栩如生地展现出来。我们将激发我们年轻时对历史的热爱与好奇心融入了《不朽之柱》之中。 对团队内许多人来说，我们在成长过程中热爱神话与怪物故事，花费了很多时间玩《帝国时代》。将这些元素结合在一起是非常神奇的，我们很幸运能从事如此贴近我们内心的工作。我们希望为大家提供一场穿越古代神祇年代的引人入胜的旅程。 &#8211; 维塔士团队 Forgotten Empires团队拥有十多年参与《帝国时代》系列的经验，在开发《不朽之柱》时，我们始终保持着对自己标志性特点的关注：创新、真实性以及最重要的——乐趣。将中国这样丰富的文化加入到游戏中，值得我们用同样丰富的方式来呈现，作为长期热爱游戏开发的团队，我们很高兴能将我们的经验以及在叙事、视觉和游戏玩法方面的专业知识应用到其中。《不朽之柱》是对中国历史和神话的致敬；是对整个《帝国时代》系列的致敬；更重要的是向我们全球的玩家们致敬。我们希望《不朽之柱》能带给大家与我们一样的快乐，正如以往一样，我们感激你们对这一伟大系列的持续热爱！ -The Forgotten Empires 团队 立即预购《神话时代：重述版 ——不朽之柱》！ 等待已久的时刻终于到来——中国神祇殿堂现已开放预购！作为备受期待的《神话时代：重述版》首个扩展包，《不朽之柱》邀请你掌握古代中国神话的力量。探索一个神祇、怪物和传说相撞，展开史诗般的神话战略新篇章的世界。 不朽之柱》现已在Steam、Microsoft Store、Xbox放预购 –– 将于3月4日上线！",
    "pubDate": "Tue, 04 Feb 2025 18:24:00 +0000",
    "image": "https://cdn.ageofempires.com/aoe/wp-content/uploads/2025/01/immortal_pillars_1920x1080_key_art-1080x608.webp"
  },
  {
    "title": "What’s Coming in 2025 for Age of Empires and Age of Mythology",
    "link": "https://www.ageofempires.com/news/whats-coming-in-2025-for-age-of-empires-and-age-of-mythology/",
    "description": "2024 was a year for Age of Empires and Age of Mythology players and —a year shaped by your passion, creativity, and epic moments. Thanks to your dedication, it’s been an incredible year not just for the community, but for the franchise as a whole. Together, we’ve had an incredible year. We kicked things off with the New Year, New Age showcase, crowned champions at Red Bull Wololo: El Reinado, connected with many of you at Gamescom, and celebrated the launches of Age of Mythology: Retold and Age of Empires Mobile. Along the way, we expanded the franchise in new ways and welcomed over 10 million new players—reaching an incredible milestone of 60 million Age of Empires players worldwide. \n\nOur players continue to influence the many ways in which the franchise moves forward. Today we’re thrilled to start 2025 by unveiling what’s ahead. Settle in, because we’ve got a lot to share!",
    "pubDate": "Tue, 04 Feb 2025 18:07:40 +0000",
    "image": "https://cdn.ageofempires.com/aoe/wp-content/uploads/2025/02/2025_Feb_4_Blog_Header_2-1080x608.webp"
  }
]